### [ 인덱스 다루기 - MultiIndex]
- 기본 인덱스
    * .set_index()      <-- 컬럼을 인덱스로 설정>
    * .reindex()        <-- 인덱스 재구성(일부 변경, 결측치 발생 가능)>
    * .reset_index()    <-- 위치 인덱스(RangeIndex)로 변경. 기존 인덱스는 컬럼 추가>
    * .iloc[위치인덱스]  <-- 판다스엣서 DF/S에 데이터가 존재하는 위치 번호를 지정/정수>
    * .loc[라벨인덱스] <-- DF/S 생성 시 index, columns 매개변수로 지정한 인덱스들>
- 멀티 인덱스 
    -

[1] 모듈 로딩 및 데이터 준비 <hr>

In [1]:
## 모듈 로딩
import pandas as pd

In [ ]:
## 데이터 준비
DATA_FILE = '../Data/학생관리부.xlsx'

## excel --> DF 로딩
## skiprows : 상단의 행 버리기
## index_col : 해당 컬럼 index로 설정
# dataDF = pd.read_excel(DATA_FILE, skiprows=2, index_col=0

dataDF = pd.read_excel(DATA_FILE, skiprows=2, index_col=[1,2])

In [11]:
## 확인
display(dataDF.head())

    이름  학년  반   석차
0  홍길동   1  1    8
1  고길동   1  3    1
2  이길동   1  7   12
3  박길동   3  1    9
4  최길동   2  1   43

[2] DF에서 인덱스관련 메서드 다루기 <hr>

In [ ]:
## ----------------------------------------------------------
## 멀티인덱스 속성 확인
## ----------------------------------------------------------
mIdx = dataDF.columns

print('----------------------------------------')
print(f'type(mIdx)  : {type(mIdx)}')
print(f'names       : {mIdx.names}')
print(f'levels      : {mIdx.levels}')
print(f'dtypes      :\n{mIdx.dtypes}')
print(f'nlevels     : {mIdx.nlevels}')
print('----------------------------------------')
print(f'levshape    : {mIdx.levshape}')
print(mIdx)

----------------------------------------
type(mIdx)  : <class 'pandas.core.indexes.base.Index'>
names       : [None]

AttributeError: 'Index' object has no attribute 'levels'

In [ ]:
## -> [실습] 석차 컬럼이 인덱스 설정 및 내림차순 정렬
display(dataDF.index)

dataDF3 = dataDF.set_index([' 석차']).sort_index(ascending=False)
dataDF3

MultiIndex([(1, 1),
            (1, 3),
            (1, 7),
            (3, 1),
            (2, 1)],
           names=['학년', '반'])

      이름
 석차
43   최길동
12   이길동
9    박길동
8    홍길동
1    고길동

In [ ]:
## --------------------------------------
## 2-1 행데이터 선택
## --------------------------------------
## 전체 행인덱스로 선택
oneSR = dataDF.loc[(1,7)]
print(f'\ndadtaDF.loc[(1,7)]\n {oneSR}\n')

## 레벨 0번 행인덱스로 선택 => 레벨 0 동일한 행 반환
level0 = dataDF.loc[(1)]
print(f'\ndadtaDF.loc[(1)]\n {level0}\n')

## - .loc[]/.iloc[] : 멀티인덱스에서 레벨순서대로 지정햇을 때만 사용 가능
## level1번 행인덱스로 선택 ==> level1 동일한 모든 행
## => xs()메서드 사용

# level1 = dataDF.loc[(7)]                      ==> ERROR
# print(f'\ndadtaDF.loc[(7)]\n {level1}\n')

level1 = dataDF.xs(7, level='반')
print(f'\ndadtaDF.loc[(7)]\n {level1}\n')

dadtaDF.loc[(1,7)]
 이름     이길동
 석차     12
Name: (1, 7), dtype: object


dadtaDF.loc[(1)]
     이름   석차
반
1  홍길동    8
3  고길동    1
7  이길동   12


dadtaDF.loc[(7)]
      이름   석차
학년
1   이길동   12

In [ ]:
display(dataDF)

       이름   석차
학년 반
1  1  홍길동    8
   3  고길동    1
   7  이길동   12
3  1  박길동    9
2  1  최길동   43

In [ ]:
## [실습] 1반 친구들만 선택하기
df = dataDF.xs(1, level='반')
df

     이름   석차
학년
1   홍길동    8
3   박길동    9
2   최길동   43

In [ ]:
dataDF.loc[(2,2), : ]= 0
dataDF.sort_index(inplace=True)
dataDF

       이름    석차
학년 반
1  1  홍길동   8.0
   3  고길동   1.0
   7  이길동  12.0
2  1  최길동  43.0
   2    0   0.0
3  1  박길동   9.0

In [ ]:
## => 모든 컬럼 다른 값 추가
dataDF.loc[(2,3), :] = ['베트맨', 3]
dataDF.sort_index(inplace=True)
dataDF

       이름    석차
학년 반
1  1  홍길동   8.0
   3  고길동   1.0
   7  이길동  12.0
2  1  최길동  43.0
   2    0   0.0
   3  베트맨   3.0
3  1  박길동   9.0

In [ ]:
## ----------------------------------------
## [2-2] 열 추가
## ----------------------------------------
dataDF['번호'] = 0
dataDF.head()

       이름    석차  번호
학년 반
1  1  홍길동   8.0   0
   3  고길동   1.0   0
   7  이길동  12.0   0
2  1  최길동  43.0   0
   2    0   0.0   0

In [ ]:
dataDF['학교']= ['대구', '대구', '부산', '대전', '마산', '대구', '서울']
dataDF

       이름    석차  번호  학교
학년 반
1  1  홍길동   8.0   0  대구
   3  고길동   1.0   0  대구
   7  이길동  12.0   0  부산
2  1  최길동  43.0   0  대전
   2    0   0.0   0  마산
   3  베트맨   3.0   0  대구
3  1  박길동   9.0   0  서울

In [ ]:
## -------------------------------------------
## [2-3] 행 인덱스 초기화
## -------------------------------------------
## -> 모든 멀티 인덱스 => 컬럼으로 추가
dataDF.reset_index()

   학년  반   이름    석차  번호  학교
0   1  1  홍길동   8.0   0  대구
1   1  3  고길동   1.0   0  대구
2   1  7  이길동  12.0   0  부산
3   2  1  최길동  43.0   0  대전
4   2  2    0   0.0   0  마산
5   2  3  베트맨   3.0   0  대구
6   3  1  박길동   9.0   0  서울

In [ ]:
## -> 특정 레벨 행 인덱스만 => 컬럼으로 
dataDF.reset_index(level=['반'])

    반   이름    석차  번호  학교
학년
1   1  홍길동   8.0   0  대구
1   3  고길동   1.0   0  대구
1   7  이길동  12.0   0  부산
2   1  최길동  43.0   0  대전
2   2    0   0.0   0  마산
2   3  베트맨   3.0   0  대구
3   1  박길동   9.0   0  서울